'use strict'
// 2. Сделать генерацию корзины динамической: верстка корзины не должна находиться в HTML - структуре.Там должен быть только div, в который будет вставляться корзина, сгенерированная на базе JS:
// 2.1.Пустая корзина должна выводить строку «Корзина пуста»;
// 2.2.Наполненная должна выводить «В корзине: n товаров на сумму m рублей».
// 3 *.Сделать так, чтобы товары в каталоге выводились при помощи JS:
// 3.1.Создать массив товаров(сущность Product);
// 3.2.При загрузке страницы на базе данного массива генерировать вывод из него.HTML - код должен содержать только div id =”catalog” без вложенного кода.Весь вид каталога генерируется JS.


